In [44]:

import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime, timedelta

In [45]:
df_user_eng= pd.read_csv('takehome_user_engagement.csv');

In [46]:
df_user=pd.read_csv('takehome_users.csv',encoding="latin");

In [47]:
df_user_eng.head()

            time_stamp  user_id  visited
0  2014-04-22 03:53:30        1        1
1  2013-11-15 03:45:04        2        1
2  2013-11-29 03:45:04        2        1
3  2013-12-09 03:45:04        2        1
4  2013-12-25 03:45:04        2        1

In [48]:
df_user_eng.describe()

             user_id   visited
count  207917.000000  207917.0
mean     5913.314197       1.0
std      3394.941674       0.0
min         1.000000       1.0
25%      3087.000000       1.0
50%      5682.000000       1.0
75%      8944.000000       1.0
max     12000.000000       1.0

In [49]:
df_user.head()

,object_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0

In [50]:
df_user.describe()

,object_id,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
count,12000.00000,8.823000e+03,12000.000000,12000.000000,12000.000000,6417.000000
mean,6000.50000,1.379279e+09,0.249500,0.149333,141.884583,5962.957145
std,3464.24595,1.953116e+07,0.432742,0.356432,124.056723,3383.761968
min,1.00000,1.338452e+09,0.000000,0.000000,0.000000,3.000000
25%,3000.75000,1.363195e+09,0.000000,0.000000,29.000000,3058.000000
50%,6000.50000,1.382888e+09,0.000000,0.000000,108.000000,5954.000000
75%,9000.25000,1.398443e+09,0.000000,0.000000,238.250000,8817.000000
max,12000.00000,1.402067e+09,1.000000,1.000000,416.000000,11999.000000

The user_id and object_id are comman features of the two data frame.

In [59]:
#changing the date time format
df_user_eng.time_stamp = df_user_eng.time_stamp.astype('datetime64')
df_user.creation_time = df_user.creation_time.astype('datetime64')
df_user.last_session_creation_time = pd.to_datetime(df_user.last_session_creation_time, \
                                                      unit='s')

In [65]:
df_user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   object_id                   12000 non-null  int64
 1   creation_time               12000 non-null  datetime64[ns]
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  8823 non-null   datetime64[ns]
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          6417 non-null   float64
dtypes: datetime64[ns](2), float64(1), int64(4), object(3)
memory usage: 937.6+ KB

In [69]:
df_user.isnull().values.any()

True

In [73]:
df_user.last_session_creation_time.isnull().values.any()

True

In [67]:
df_user_eng.isnull().values.any()

False

In [81]:
#Will group by the 'user_id' which shows how many times he/she logged in and then collect the data for >3 
user_id_bool = pd.Series.to_dict(df_user_eng.groupby('user_id').visited.count() >= 3)

In [82]:
#Will map this boolian series to df_user_eng dataframe and creat a column for multiple (>3) logins
df_user_eng['multiple_logins'] = df_user_eng.user_id.map(user_id_bool)

In [87]:
df_user_eng.head()

           time_stamp  user_id  visited  multiple_logins
0 2014-04-22 03:53:30        1        1            False
1 2013-11-15 03:45:04        2        1             True
2 2013-11-29 03:45:04        2        1             True
3 2013-12-09 03:45:04        2        1             True
4 2013-12-25 03:45:04        2        1             True

In [88]:
#Getting all the multiple logins user
active_user = df_user_eng[df_user_eng.multiple_logins == True]

In [89]:
active_user.head()

           time_stamp  user_id  visited  multiple_logins
1 2013-11-15 03:45:04        2        1             True
2 2013-11-29 03:45:04        2        1             True
3 2013-12-09 03:45:04        2        1             True
4 2013-12-25 03:45:04        2        1             True
5 2013-12-31 03:45:04        2        1             True

In [92]:
#Difference between 'time_stamp' for each user
active_user['Diff'] = active_user.groupby('user_id').time_stamp.diff().dt.days
active_user.head()

/Users/neeharikasinha/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

           time_stamp  user_id  visited  multiple_logins  Diff
1 2013-11-15 03:45:04        2        1             True   NaN
2 2013-11-29 03:45:04        2        1             True  14.0
3 2013-12-09 03:45:04        2        1             True  10.0
4 2013-12-25 03:45:04        2        1             True  16.0
5 2013-12-31 03:45:04        2        1             True   6.0

In [94]:
#Collecting those users who was active for consicutive 7 days
active_user_7day = active_user[active_user.Diff <= 7]

In [95]:
#Count the number of logins that satisfy the above criteria
active_user_count = pd.DataFrame(active_user_7day.groupby('user_id')['user_id'].count())

In [96]:
#Rename column and reset index
active_user_count = active_user_count.rename(columns={'user_id':'count'})
active_user_count = active_user_count.reset_index()

In [97]:
#Find the list of adopted users who have more than 3 logins in a 7 day period
adopted_users = active_user_count[active_user_count['count'] >= 3]
len(adopted_users)

1688

In [98]:
adopted_users.head()

   user_id  count
0        2      6
1       10    280
2       20      4
3       33     16
4       42    339

In [99]:
#Will section out the adopted users from df_users dataframe
users_interest= df_user.loc[df_user['object_id'].isin(adopted_users.user_id)]

In [100]:
#Add a column with 1 for adopted_users. 
users_interest.insert(10, 'adopted_user', 1) #position, title, value

In [101]:
#get the index of the adopted users
users_series = users_interest[['adopted_user']]

In [103]:
users_series.head()

    adopted_user
1              1
9              1
19             1
32             1
41             1

In [105]:
#concatenate this coloumn onto end of complete df_user dataframe, then fill in remaining values with 0
df_adopted_user = pd.concat([df_user, users_series], axis=1)
df_adopted_user['adopted_user'].fillna(0, inplace=True )

In [106]:
df_adopted_user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12000 entries, 0 to 11999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   object_id                   12000 non-null  int64
 1   creation_time               12000 non-null  datetime64[ns]
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  8823 non-null   datetime64[ns]
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          6417 non-null   float64
 10  adopted_user                12000 non-null  float64
dtypes: datetime64[ns](2), float64(2), int64(4), object(3)
memory usage: 1.1+ MB

In [107]:

print(df_adopted_user['creation_source'].value_counts())

ORG_INVITE            4254
GUEST_INVITE          2163
PERSONAL_PROJECTS     2111
SIGNUP                2087
SIGNUP_GOOGLE_AUTH    1385
Name: creation_source, dtype: int64